package mecabs

import "testing"

func TestPhraseSurface(t *testing.T) {
	ph := Phrase{
		{"あ", "", "", "", "", "", "", "", "", ""},
		{"い", "", "", "", "", "", "", "", "", ""},
		{"う", "", "", "", "", "", "", "", "", ""},
		{"え", "", "", "", "", "", "", "", "", ""},
		{"お", "", "", "", "", "", "", "", "", ""},
	}
	if ph.Surface() != "あいうえお" {
		t.Errorf("expected あいうえお, but %v\n", ph.Surface())
	}
}

func TestPhraseReading(t *testing.T) {
	ph := Phrase{
		{"", "", "", "", "", "", "", "", "あ", ""},
		{"", "", "", "", "", "", "", "", "い", ""},
		{"", "", "", "", "", "", "", "", "う", ""},
		{"", "", "", "", "", "", "", "", "え", ""},
		{"", "", "", "", "", "", "", "", "お", ""},
	}
	r, ok := ph.Reading()
	if !ok || r != "あいうえお" {
		t.Errorf("expected あいうえお, but %v\n", r)
	}
	ph = Phrase{
		{"", "", "", "", "", "", "", "", "あ", ""},
		{"", "", "", "", "", "", "", "", "い", ""},
		{"", "", "", "", "", "", "", "", "う", ""},
		{"", "", "", "", "", "", "", "", "え", ""},
		{"", "", "", "", "", "", "", "", "", ""},
	}
	r, ok = ph.Reading()
	if ok || r != "あいうえ" {
		t.Errorf("expected あいうえ, but %v\n", r)
	}
}

func TestPhrasePronounciation(t *testing.T) {
	ph := Phrase{
		{"", "", "", "", "", "", "", "", "", "あ"},
		{"", "", "", "", "", "", "", "", "", "い"},
		{"", "", "", "", "", "", "", "", "", "う"},
		{"", "", "", "", "", "", "", "", "", "え"},
		{"", "", "", "", "", "", "", "", "", "お"},
	}
	p, ok := ph.Pronounciation()
	if !ok || p != "あいうえお" {
		t.Errorf("expected あいうえお, but %v\n", p)
	}
	ph = Phrase{
		{"", "", "", "", "", "", "", "", "", "あ"},
		{"", "", "", "", "", "", "", "", "", "い"},
		{"", "", "", "", "", "", "", "", "", "う"},
		{"", "", "", "", "", "", "", "", "", "え"},
		{"", "", "", "", "", "", "", "", "", ""},
	}
	p, ok = ph.Pronounciation()
	if ok || p != "あいうえ" {
		t.Errorf("expected あいうえ, but %v\n", p)
	}
}
